In [18]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [ ]:
df = pd.read_csv('../data/CustomersTransactions2021.csv')

In [ ]:
df.shape

In [ ]:
df.head()

,customer_id,id,txn_type,txn_total,Customers,Products,Province,Relationship,Category
0,1001,1,Debit,165.78,Johnny Awesome,3,ON,1,wealth
1,1001,2,Credit,42.10,Johnny Awesome,3,ON,1,wealth
2,1001,4,Credit,103.03,Johnny Awesome,3,ON,1,wealth
3,1001,5,Credit,56.60,Johnny Awesome,3,ON,1,wealth
4,1002,6,Debit,214.34,Bob Marley,4,ON,1,personal_banking

In [22]:
df.head(15)

,customer_id,id,txn_type,txn_total,Customers,Products,Province,Relationship,Category
0,1001,1,Debit,165.78,Johnny Awesome,3,ON,1,wealth
1,1001,2,Credit,42.10,Johnny Awesome,3,ON,1,wealth
2,1001,4,Credit,103.03,Johnny Awesome,3,ON,1,wealth
3,1001,5,Credit,56.60,Johnny Awesome,3,ON,1,wealth
4,1002,6,Debit,214.34,Bob Marley,4,ON,1,personal_banking
5,1002,7,Cash,115.69,Bob Marley,4,ON,1,personal_banking
6,1002,8,Debit,21.37,Bob Marley,4,ON,1,personal_banking
7,1004,9,Cash,227.58,Taylor Swift,2,AB,2,hnw
8,1004,10,Credit,5.92,Taylor Swift,2,AB,2,hnw
9,1006,11,Debit,225.89,Stephen Smith,5,ON,4,hnw
10,1014,12,Cash,67.96,Delilah Avery,2,AB,3,personal_banking
11,1014,20,Debit,449.39,Delilah Avery,2,AB,3,personal_banking
12,1014,28,Cash,183.08,Delilah Avery,2,AB,3,personal_banking
13,1254,13,Debit,235.79,Johnson Cory,1,AB,4,hnw
14,1254,21,Cash,15.26,Johnson Cory,1,AB,4,hnw

#### 1) 'Transaction_ID' v/s 'Txn_total':

In [23]:
# sorting 'txn_id' to plot it along a Line Graph:

In [24]:
df.sort_values('id', inplace = True)

In [25]:
df.head(15)

,customer_id,id,txn_type,txn_total,Customers,Products,Province,Relationship,Category
0,1001,1,Debit,165.78,Johnny Awesome,3,ON,1,wealth
1,1001,2,Credit,42.10,Johnny Awesome,3,ON,1,wealth
2,1001,4,Credit,103.03,Johnny Awesome,3,ON,1,wealth
3,1001,5,Credit,56.60,Johnny Awesome,3,ON,1,wealth
4,1002,6,Debit,214.34,Bob Marley,4,ON,1,personal_banking
5,1002,7,Cash,115.69,Bob Marley,4,ON,1,personal_banking
6,1002,8,Debit,21.37,Bob Marley,4,ON,1,personal_banking
7,1004,9,Cash,227.58,Taylor Swift,2,AB,2,hnw
8,1004,10,Credit,5.92,Taylor Swift,2,AB,2,hnw
9,1006,11,Debit,225.89,Stephen Smith,5,ON,4,hnw
10,1014,12,Cash,67.96,Delilah Avery,2,AB,3,personal_banking
13,1254,13,Debit,235.79,Johnson Cory,1,AB,4,hnw
16,1285,14,Cash,160.89,Maria Alva,5,ON,2,wealth
19,1354,15,Credit,377.26,Jessica Fast,4,BC,5,personal_banking
22,1005,16,Debit,276.01,Mariah Anita Smith,2,BC,3,personal_banking

### 2) plot():

In [ ]:
plt.plot(df['id'] , df['txn_total'])

In [ ]:
plt.plot(df['id'] , df['txn_total'], 'r--', label = 'TRANSACTION AMTS.')
plt.title('Line Graph of Txn_Total')
plt.xlabel('Transaction_ID')
plt.ylabel('Txn amounts in $', rotation = 0, loc = "top", labelpad = 40)
plt.legend()

In [ ]:
plt.figure(figsize = (15, 5))
plt.plot(df['id'] , df['txn_total'], 'mo:', label = 'TRANSACTION AMTS.')
plt.title('Line Graph of Txn_Total')
plt.xlabel('Transaction_ID')
plt.ylabel('Txn amounts in $', rotation = 0, loc = "top")
plt.legend()

In [ ]:
plt.figure(figsize = (15, 5))
plt.plot(df['id'] , df['txn_total'], 'mo:', label = 'TRANSACTION AMTS.', linewidth = 4)
plt.title('Line Graph of Txn_Total')
plt.xlabel('Transaction_ID')
plt.ylabel('Txn amounts in $', rotation = 0, loc = "top")
plt.legend()

##### Separate Function, to Annotate every marker ('point'):

In [ ]:
plt.figure(figsize = (15, 8))
plt.plot(df['id'] , df['txn_total'], 'mo:', label = 'TRANSACTION AMTS.', linewidth = 4)
plt.title('Line Graph of Txn_Total')
plt.xlabel('Transaction_ID')
plt.ylabel('Txn amounts in $', rotation = 0, loc = "top")
plt.legend()

# 'zip': SHAHAF's answer in 
# https://stackoverflow.com/questions/49783594/for-loop-and-zip-in-python
for x,y in zip(df['id'] , df['txn_total']):
    label = "{:.2f}".format(y)
    plt.annotate(label, (x,y))

### 3) Histograms:

In [ ]:
df.head(5)

In [ ]:
plt.hist(df['txn_total'])

In [ ]:
plt.hist(df['txn_total'], bins = 5)

In [ ]:
plt.hist(df['txn_total'], bins = 5, label = 'TRANSACTION_TOTAL')
plt.title('Histogram of Txn_total')
plt.xlabel('Txn amounts in $')
plt.ylabel('Count of Txns')
plt.legend()

In [ ]:
n,bins, patches = plt.hist(df['txn_total'], bins = 5, label = 'TRANSACTION_TOTAL')
plt.title('Histogram of Txn_total')
plt.xlabel('Txn amounts in $')
plt.ylabel('Count of Txns')
plt.legend()

In [ ]:
n

In [ ]:
bins

In [ ]:
patches

#### 4) Boxplots:

In [ ]:
plt.boxplot(df['txn_total'])
plt.title('Boxplot of Txn_amts')
plt.xlabel('Txn amounts')
plt.ylabel('ranges')

In [ ]:
df.describe()

#### 5) Subplots:

In [ ]:
# to display multiple plots, in the same Figure object:

In [ ]:
df.head()

In [ ]:
df['Customers'].unique()

In [ ]:
fig, ((ax1, ax2, ax3) , (ax4, ax5, ax6)) =  plt.subplots(2,3)

In [ ]:
fig, ((ax1, ax2, ax3) , (ax4, ax5, ax6)) =  plt.subplots(2,3, sharex = True, sharey = True,
                                                         figsize = (10, 5) )

In [ ]:
fig, ((ax1, ax2, ax3) , (ax4, ax5, ax6)) =  plt.subplots(2,3, sharex = False, sharey = True,
                                                         figsize = (10, 5) )

ax1.plot(df[df['Customers']== "Johnny Awesome"]['id'], 
         df[df['Customers']== "Johnny Awesome"]['txn_total'], 'r--' )


ax2.plot(df[df['Customers']== "Bob Marley"]['id'], 
         df[df['Customers']== "Bob Marley"]['txn_total'], 'g:' )


ax3.plot(df[df['Customers']== "Taylor Swift"]['id'], 
         df[df['Customers']== "Taylor Swift"]['txn_total'], 'ro-' )

In [ ]:
fig, ((ax1, ax2, ax3) , (ax4, ax5, ax6)) =  plt.subplots(2,3, sharex = False, sharey = True,
                                                         figsize = (10, 5) )

ax1.plot(df[df['Customers']== "Johnny Awesome"]['id'], 
         df[df['Customers']== "Johnny Awesome"]['txn_total'], 'r--' )


ax2.plot(df[df['Customers']== "Bob Marley"]['id'], 
         df[df['Customers']== "Bob Marley"]['txn_total'], 'g:' )


ax3.plot(df[df['Customers']== "Taylor Swift"]['id'], 
         df[df['Customers']== "Taylor Swift"]['txn_total'], 'ro-' )

ax1.set_title("Johnny Awesome spend")
ax2.set_title("Bob Marley spend")
ax3.set_title("Taylor Swift spend")

In [ ]:
plt.plot(df[df['Customers']== "Johnny Awesome"]['id'], 
         df[df['Customers']== "Johnny Awesome"]['txn_total'], 'r--')

plt.plot(df[df['Customers']== "Bob Marley"]['id'], 
         df[df['Customers']== "Bob Marley"]['txn_total'], 'g:')

#### 6) Bar Graphs:

In [ ]:
df.head()

In [ ]:
df['Category'].unique()

In [ ]:
df.head(15)

In [ ]:
# Q1. Bar graph of ''#Customers, per Category':

In [ ]:
# method#1:
df.groupby('Category').aggregate({'customer_id': 'count'}).plot(kind = 'bar')

# method2:
# additional benefit: Lists the COUNTS in Descending order
df['Category'].value_counts().plot(kind = 'bar')

In [ ]:
# Q2. Bar graph showing the total amount spent, per Category:

In [ ]:
df.groupby('Category').agg({'txn_total': 'sum'})

In [ ]:
df.groupby('Category').agg({'txn_total': 'sum'}).plot(kind = 'bar')

In [ ]:
df.groupby('Category').agg({'txn_total': 'sum'}).plot(kind = 'bar', figsize = (10,5))

In [ ]:
# To plot the above bars in descending order:

In [ ]:
df.groupby('Category').aggregate({'txn_total':'sum'}).\
    sort_values(by = 'txn_total', ascending = False).\
    plot(kind = 'bar')

In [ ]:
# To annotate each bar:

In [ ]:
sortedAmtSpent_df = df.groupby('Category').aggregate({'txn_total':'sum'}).sort_values(by = 
                                'txn_total', ascending = False)

sortedAmtSpent_df.axes 
# O/P:
# 3 indexes named 'pb, hnw, wealth'; 
# 1 column named 'txn_total'

In [ ]:
amts = sortedAmtSpent_df['txn_total'] # Series object-- includes the Index_values in the o/p
amts

In [ ]:
for i, each_amt in enumerate(amts):
    plt.text(i, each_amt, str(each_amt), ha = 'center', va = 'bottom')
    
# Syntax: `plt.bar()`:
# plt.bar(LIST[x_centres_PerBar] or LIST[xLabels_per_Bar], LIST[Bar_heights], width_per_bar)
plt.bar(sortedAmtSpent_df.index, sortedAmtSpent_df['txn_total'], color = ['magenta','cyan','pink'])

In [ ]:
## ## Bar graph showing the amounts spent per 'txn_type', within each Banking_category:

In [ ]:
df.groupby(['Category','txn_type']).agg({'txn_total': 'sum'}) # o/p as a DF

In [ ]:
df.groupby(['Category','txn_type']).agg({'txn_total': 'sum'}).unstack('txn_type').\
plot(kind= 'bar', stacked = True)

### 7) Scatterplot():

In [ ]:
df.head()

In [ ]:
len(df)

In [ ]:
df['acct_balance'] = np.random.randint(0,1000, size = len(df))

In [ ]:
df.head()

In [ ]:
# x = acct_balance
plt.scatter(df['acct_balance'], df['txn_total'])
plt.title('Scatterplot of acct_bal & txn_total')
plt.xlabel('acct_bal')
plt.ylabel('txn_total')

#### 8) Seaborn:

In [ ]:
import seaborn as sns

##### 8.1) Seaborn-> scatterplot:

In [ ]:
sns.lmplot(x = 'acct_balance' , y = 'txn_total' , data= df)

##### 8.2) Seaborn-> boxplot:

In [ ]:
sns.boxplot(x = 'Category' , y = 'txn_total' , data= df)

##### 8.3) Pairplot():

In [ ]:
sns.pairplot(df)

In [ ]:
# overlay a Categorical column:
sns.pairplot(df, hue = 'txn_type')

#### 8.4) Heatmap:

In [ ]:
df.corr(numeric_only = True) # can only be used for Pandas-1.5.0 or higher

In [ ]:
print(pd.__version__)

In [ ]:
df.columns

In [ ]:
needed_numeric_cols = ['txn_total', 'Products', 'Relationship', 'acct_balance']

sns.heatmap(df[needed_numeric_cols].corr(), annot = True, vmin = -1 , vmax = 1)

##### 8.5) Distplots:

In [ ]:
sns.distplot(df['txn_total'])
plt.savefig('MY_DISTPLOT.pdf')

#### 8.6) Bubble charts:

In [ ]:
df.head()

In [ ]:
# Bubble Chart: 
# to visualize 4 variables on a scatterplot:

sns.scatterplot( x = 'id', y = 'acct_balance', data= df, hue = 'txn_type', size = 'txn_total')

plt.legend(loc = 1, bbox_to_anchor = (1.3, 1))  # to move the legend OUTSIDE the plot

In [ ]:
# setting the Bubble Chart to be of a specific size:

width = 15
height = 5


sns.set(rc = {'figure.figsize': (width,height) })

sns.scatterplot( x = 'id', y = 'txn_total', data = df, hue = 'txn_type', size = 'txn_total')

plt.legend(loc = 1, bbox_to_anchor = (1.2,1))